ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0c1105_c1106/COMP0_1.0.xml
    <register id="COMP0_CTL3" width="32" offset="0x110C" description="Control 3">
        <bitfield id="DACCODE0" description="This is the first 8-bit DAC code. When the DAC code is 0x0 the DAC output will be selected reference voltage x 1/256 V. When the DAC code is 0xFF the DAC output will be selected reference voltage x 255/256 V." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="Minimum DAC code value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Minimum DAC code value"/>
        </bitfield>
        <bitfield id="DACCODE1" description="This is the second 8-bit DAC code. When the DAC code is 0x0 the DAC output will be selected reference voltage x 1/256 V. When the DAC code is 0xFF the DAC output will be selected reference voltage x 255/256 V." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="Minimum DAC code value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Minimum DAC code value"/>
        </bitfield>
    </register>
    <register id="COMP0_STAT" width="32" offset="0x1120" description="Status">
        <bitfield id="OUT" description="This bit reflects the value of the comparator output. Writing to this bit has no effect on the comparator output." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="LOW" value="0x0" description="Comparator output is low"/>
            <bitenum id="HIGH" value="0x1" description="Comparator output is high"/>
        </bitfield>
    </register>

</module>